## Вопросы к требованиям:
1. Время, за которое сервер должен обработать результаты теста (между завершением теста и выводом результатов на экран).
2. Внешний вид экрана ожидания на время обработки результата.
3. Время прохождения одинаково для всех тестов, установлено для каждого отдельно или привязано к категориям тестов.
4. Можно ли приостановить отсчет времени во время прохождения теста.
5. При 100% правильных ответов включает ли отчет о результатах теста какие-то рекомендации.
6. Как должен сервер обработать потерю соединения - начать тест заново или сохранять прогресс пользователя?
7. При повторном прохождении теста записывается новый отчет или обновляется запись старого.

## Подход к тестированию:
1. Цели тестирования:
1.1. Проверка соответствия работы модуля требованиям.
1.2. Проверка производительности модуля.
1.3. Оценка пользовательского опыта.
2. Стратегия:
2.1. Для достижения цели проверки соответствия требованиям тестирование необходимо начать как можно раньше на этапе проектирования бизнес-логики модуля. Для предотвращения появления дефектов отделу QA необходимо провести проверку документации API. По ней составляются тест-кейсы API, которые позволят приступить к тестированию модуля до разработки фронтенда.
2.2. Проверку производительности модуля необходимо провести при различных (минимальных, средних, максимальных) нагрузках. Необходимо включить стресс-тестирование для выявления максимальной предельной нагрузки и проверке ответа сервера на нагрузку, превышающую максимальную.
2.3. Для оценки пользовательского опыта необходимо провести сценарные тесты:
2.3.1. первое прохождение теста;
2.3.2. повторное прохождение теста;
2.3.3. прерывание прохождения теста.
3. Автоматизация:
3.1. регрессионные API тесты в Postman;
3.2. тестирование пользовательского интерфейса.
4. Инструменты:
4.1. Playwright  для автоматизированных тестов GUI;
4.2. JMeter для нагрузочного тестирования;
4.3. Postman для API тестов;
4.4. BrowserStack для кроссбраузерного тестирования.

## Тест-кейсы
| Тестирование модуля анализа результатов теста |                                                               |                                                                                                                                |                                                                                                                                                                           |
|-----------------------------------------------|---------------------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| ID                                            | Описание                                                      | Шаги воспроизведения                                                                                                           | Ожидаемый результат                                                                                                                                                       |
| TA-01                                         | Проверка отсчета времени для теста уровня «Light».            | Запустить тест уровня «Light».                                                                                                 | Обратный отсчет ведется от 10:00 минут.                                                                                                                                   |
| TA-02                                         | Проверка отсчета времени. Наличие предупреждения.             | 1. Запустить процесс тестирования.<br>2. Дождаться, когда обратный отсчёт покажет 5:00 минут.                                  | На 3 секунды появляется поп-ап с текстом «До конца теста 5 минут». Стиль обратного отсчета изменился на «алёрт».                                                          |
| TA-03                                         | Проверка отчета о тестировании. 100% правильных вопросов      | Пройти тест, ответив правильно на все вопросы.                                                                                 | Отчёт о тестировании содержит текст «Количество правильных ответов - 100%» и три ссылки на дополнительные курсы.                                                          |
| TA-04                                         | Проверка отчета о тестировании. Наличие рекомендаций.         | Пройти тест, ответив неправильно на три вопроса.                                                                               | Отчтет о тестировании содержит текст с общим процентом правильных ответов. К каждому пункту списка<br>неверных ответов добавлена соответствующая рекомендация.            |
| TA-05                                         | Проверка сохранения отчета в личный кабинет.                  | 1. Пройти тест. Дождаться загрузки отчета.<br>2. Перейти на страницу личного кабинета.                                         | В списке отчетов о тестировании появилась новая запись.                                                                                                                   |
| TA-06                                         | Проверка совместимости. Страница отчета. ОС.                  | Пройти тестирование на устройствах с Windows, MacOS, Linux (Ubuntu).                                                           | Отчет отображается идентично на всех устройствах и содержит общий процент правильных ответов, список<br>неверных ответов с объяснениями и рекомендации.                   |
| TA-07                                         | Проверка совместимости. Страница отчета. Кросс-браузерное.    | Пройти тестирование в последних версиях браузеров Google Chrome, Firefox, Safari, Opera, IE                                    | Отчет отображается идентично во всех браузерах и содержит общий процент правильных ответов, список<br>неверных ответов с объяснениями и рекомендации.                     |
| TA-08                                         | Проверка совместимости. Страница отчета. Кросс-платформенное. | 1. Пройти тестирование на мобильном устройстве.<br>2. Свайпом прокрутить страницу вниз.<br>3. Жестом увеличить масштаб экрана. | 1. Расположение элементов страницы соотвествует дизайн-шаблону для мобильных устройств.<br>2. Страницу можно прокрутить вертикально.<br>3. Масштаб страницы увеличен.<br> |

## Баг-репорты
| ID                                            | Описание                                                                                            | Серьёзность | Приоритет | Шаги воспроизведения                                                                                                                                                                                           | Ожидаемый результат                                                     | Фактический результат                                                      |
| BR-01                                         | Метод PUT для эндпойнта https://testanalyse/v2/resultsheet/id создает новый отчет результатов теста | Major       | Medium    | 1. Выполнить запрос PUT https://testanalyse/v2/resultsheet/675 c телом запроса<br>{<br>""right answers"": 67,<br>""wrong answers"": [""5"", ""7""]<br>}<br>2. Проверить запись result_id=675 в таблице results | Запись с result_id=675 соответствует данным, переданным в теле запроса. | Запись result_id=675 не обновлена. Создана новая запись с новым result_id. |
| BR-02                                         | Отсчет времени не соответсвует уровню теста.                                                        | Major       | Major     | Запустить тест уровня «Hard».                                                                                                                                                                                  | Обратный отсчет ведется от 30:00 минут.                                 | Обратный отсчет ведется от 10:00 минут.                                    |
